RespiraWorks/Ventilator/software/controller/lib/hal/hal_stm32_regs.h
    struct {
      uint32_t regular_oversampling : 1;
      uint32_t injected_oversampling : 1;
      uint32_t oversampling_ratio : 3;
      uint32_t oversampling_shift : 4;
      uint32_t triggered_oversampling : 1;
      uint32_t regular_oversampling_mode : 1;
      uint32_t reserved : 21;
    } configuration2;  // [RM] 16.6.5 ADC configuration register 2 (ADC_CFGR2)
                       // (pg 462)

    struct {
      uint32_t ch0 : 3;
      uint32_t ch1 : 3;
      uint32_t ch2 : 3;
      uint32_t ch3 : 3;
      uint32_t ch4 : 3;
      uint32_t ch5 : 3;
      uint32_t ch6 : 3;
      uint32_t ch7 : 3;
      uint32_t ch8 : 3;
      uint32_t ch9 : 3;
      uint32_t reserved1 : 2;
      uint32_t ch10 : 3;
      uint32_t ch11 : 3;
      uint32_t ch12 : 3;
      uint32_t ch13 : 3;
      uint32_t ch14 : 3;
      uint32_t ch15 : 3;
      uint32_t ch16 : 3;
      uint32_t ch17 : 3;
      uint32_t ch18 : 3;
      uint32_t reserved2 : 5;
    } sample_times;  // [RM] 16.6.6 ADC Sample Time Register 1 (ADC_SMPR1) (pg
                     // 464)

    uint32_t reserved1;
    uint32_t watchdogs[3];  // 0x20 - [RM] 16.6.8 ADC Watchdog
    uint32_t reserved2;

    // 4x sequence registers.  These registers are used
    // to define the number of A/D readings and the
    // channel numbers being read.
    struct {
      uint32_t length : 6;
      uint32_t sequence1 : 6;
      uint32_t sequence2 : 6;
      uint32_t sequence3 : 6;
      uint32_t sequence4 : 6;
      uint32_t reserved1 : 2;

      uint32_t sequence5 : 6;
      uint32_t sequence6 : 6;
      uint32_t sequence7 : 6;
      uint32_t sequence8 : 6;
      uint32_t sequence9 : 6;
      uint32_t reserved2 : 2;

      uint32_t sequence10 : 6;
      uint32_t sequence11 : 6;
      uint32_t sequence12 : 6;
      uint32_t sequence13 : 6;
      uint32_t sequence14 : 6;
      uint32_t reserved3 : 2;

      uint32_t sequence15 : 6;
      uint32_t sequence16 : 6;
      uint32_t reserved4 : 20;
    } sequence;  // ADC Regular Sequence Register (pg 468)

    uint32_t data;
    uint32_t reserved3[2];
    uint32_t injected_sequence;
    uint32_t reserved4[4];
    uint32_t offset[4];
    uint32_t reserved5[4];
    uint32_t injected_data[4];
    uint32_t reserved6[4];
    uint32_t watchdoc_config[2];
    uint32_t reserved7[2];
    uint32_t differential_mode;
    uint32_t calibration;  // 0xB4 - Calibration Factors [RM] 16.6.22 (pg 476)
    uint32_t reserved8[18];
  } adc[2];  // Master ADC1, Slave ADC2

  uint32_t common_status;
  uint32_t reserved9;
  uint32_t common_control;
  uint32_t common_data;
};
typedef volatile AdcStruct AdcReg;
inline AdcReg *const AdcBase = reinterpret_cast<AdcReg *>(0X50040000);

// Timer Register
// NOTE: Offset values and applicable registers depend on timer used
struct TimerStruct {
  union {
    struct {
      uint32_t counter_enable : 1;
      uint32_t update_disable : 1;
      uint32_t update_request_source : 1;
      uint32_t one_pulse_mode : 1;
      uint32_t direction : 1;
      uint32_t center_aligned_mode : 2;
      uint32_t auto_reload_preload : 1;
      uint32_t clock_division : 2;
      uint32_t reserved : 1;
      uint32_t uif_remapping : 1;
      uint32_t reserved2 : 20;
    } bitfield;
    uint32_t full_reg;
  } control_reg1;
  uint32_t control2;
  uint32_t slave_control;
  uint32_t interrupts_enable;
  uint32_t status;
  uint32_t event;
  uint32_t capture_compare_mode[2];
  uint32_t capture_compare_enable;
  // The topmost bit of counter will contain contain UIFCOPY if UIFREMAP is
  // enabled, but *this register should not be decomposed into a bitfield
  // struct*.  The idea behind UIFREMAP is to read the counter plus the UIFCOPY
  // value atomically, in one go.
  uint32_t counter;
  uint32_t prescaler;
  uint32_t auto_reload;
  uint32_t repeat;
  uint32_t capture_compare[4];
  uint32_t dead_time;
  uint32_t dma_control;
  uint32_t dma_address;
  uint32_t option1;
  uint32_t capture_compare_mode3;
  uint32_t capture_compare_mode5;
  uint32_t capture_compare_mode6;
  uint32_t option2;
  uint32_t option3;
};
typedef volatile TimerStruct TimerReg;

// [RM] 26 Advanced-control Timers (TIM1) (pg 718)
inline TimerReg *const Timer1Base = reinterpret_cast<TimerReg *>(0x40012C00);
// [RM] 27 General-purpose Timers (TIM2/TIM3) (pg 817)
inline TimerReg *const Timer2Base = reinterpret_cast<TimerReg *>(0x40000000);
inline TimerReg *const Timer3Base = reinterpret_cast<TimerReg *>(0x40000400);
// [RM] 29 Basic Timers (TIM6/TIM7) (pg 968)
inline TimerReg *const Timer6Base = reinterpret_cast<TimerReg *>(0x40001000);
inline TimerReg *const Timer7Base = reinterpret_cast<TimerReg *>(0x40001400);
// [RM] 28 General-purpose Timers (TIM15/TIM16) (pg 887)
inline TimerReg *const Timer15Base = reinterpret_cast<TimerReg *>(0x40014000);
inline TimerReg *const Timer16Base = reinterpret_cast<TimerReg *>(0x40014400);

// [RM] 3.7 Flash Registers (pg 100)
struct FlashStruct {
  // Access control register
  struct {
    uint32_t latency : 3;  // Number of wait states
    uint32_t reserved1 : 5;
    uint32_t prefecth_enable : 1;
    uint32_t instruction_cache_enable : 1;
    uint32_t data_cache_enable : 1;
    uint32_t instruction_cache_reset : 1;  // Instruction cache reset
    uint32_t data_cache_reset : 1;         // Data cache reset
    uint32_t run_powerdown : 1;            // Power-down during run or low power mode
    uint32_t sleep_powerdown : 1;          // Power-down during sleep mode
    uint32_t reserved2 : 17;
  } access;

  uint32_t powerdown_key;
  uint32_t key;
  uint32_t option_key;
  uint32_t status;

  // 0x14 - Control Register (FLASH_CR)
  struct {
    uint32_t program : 1;
    uint32_t page_erase : 1;
    uint32_t mass_erase : 1;
    uint32_t page : 8;
    uint32_t reserved1 : 5;
    uint32_t start_operation : 1;
    uint32_t opt_start : 1;
    uint32_t fast_programming : 1;
    uint32_t reserved2 : 5;
    uint32_t end_op_interrupt : 1;
    uint32_t error_interrupt : 1;
    uint32_t read_error_interrupt : 1;
    uint32_t force_byte_reloading : 1;
    uint32_t reserved3 : 2;
    uint32_t options_lock : 1;
    uint32_t flash_lock : 1;
  } control;

  uint32_t ecc;
  uint32_t reserved1;
  uint32_t option;
  uint32_t pcrop_start_address;
  uint32_t pcrop_end_address;
  uint32_t wrp_area_a;
  uint32_t wrp_area_b;
};
typedef volatile FlashStruct FlashReg;
inline FlashReg *const FlashBase = reinterpret_cast<FlashReg *>(0x40022000);

// [RM] 11.4.4 DMA channels (pg 302)
enum class DmaChannel {
  Chan1 = 0,
  Chan2 = 1,
  Chan3 = 2,
  Chan4 = 3,
  Chan5 = 4,
  Chan6 = 5,
  Chan7 = 6,
};

enum class DmaChannelDir { PeripheralToMemory = 0, MemoryToPeripheral = 1 };
enum class DmaTransferSize { Byte = 0, HalfWord = 1, Word = 2 };

struct DmaStruct {
  union {
    struct {
      uint32_t gif1 : 1;   // global interrupt flag
      uint32_t tcif1 : 1;  // transfer complete (TC) flag
      uint32_t htif1 : 1;  // half transfer (HT) flag
      uint32_t teif1 : 1;  // transfer error (TE) flag
      uint32_t gif2 : 1;   // global interrupt flag
      uint32_t tcif2 : 1;  // transfer complete (TC) flag
      uint32_t htif2 : 1;  // half transfer (HT) flag
      uint32_t teif2 : 1;  // transfer error (TE) flag
      uint32_t gif3 : 1;   // global interrupt flag
      uint32_t tcif3 : 1;  // transfer complete (TC) flag
      uint32_t htif3 : 1;  // half transfer (HT) flag
      uint32_t teif3 : 1;  // transfer error (TE) flag
      uint32_t gif4 : 1;   // global interrupt flag
      uint32_t tcif4 : 1;  // transfer complete (TC) flag
      uint32_t htif4 : 1;  // half transfer (HT) flag
      uint32_t teif4 : 1;  // transfer error (TE) flag
      uint32_t gif5 : 1;   // global interrupt flag
      uint32_t tcif5 : 1;  // transfer complete (TC) flag
      uint32_t htif5 : 1;  // half transfer (HT) flag
      uint32_t teif5 : 1;  // transfer error (TE) flag
      uint32_t gif6 : 1;   // global interrupt flag
      uint32_t tcif6 : 1;  // transfer complete (TC) flag
      uint32_t htif6 : 1;  // half transfer (HT) flag
      uint32_t teif6 : 1;  // transfer error (TE) flag
      uint32_t gif7 : 1;   // global interrupt flag
      uint32_t tcif7 : 1;  // transfer complete (TC) flag
      uint32_t htif7 : 1;  // half transfer (HT) flag
      uint32_t teif7 : 1;  // transfer error (TE) flag
      uint32_t reserved : 4;
    };
    uint32_t full_reg;
  } interrupt_status;  // Interrupt Status Register (DMA_ISR) [RM] 11.6.1 (pg
                       // 308)

  union {
    struct {
      uint32_t gif1 : 1;   // global interrupt flag
      uint32_t tcif1 : 1;  // transfer complete (TC) flag
      uint32_t htif1 : 1;  // half transfer (HT) flag
      uint32_t teif1 : 1;  // transfer error (TE) flag
      uint32_t gif2 : 1;   // global interrupt flag
      uint32_t tcif2 : 1;  // transfer complete (TC) flag
      uint32_t htif2 : 1;  // half transfer (HT) flag
      uint32_t teif2 : 1;  // transfer error (TE) flag
      uint32_t gif3 : 1;   // global interrupt flag
      uint32_t tcif3 : 1;  // transfer complete (TC) flag
      uint32_t htif3 : 1;  // half transfer (HT) flag
      uint32_t teif3 : 1;  // transfer error (TE) flag
      uint32_t gif4 : 1;   // global interrupt flag
      uint32_t tcif4 : 1;  // transfer complete (TC) flag
      uint32_t htif4 : 1;  // half transfer (HT) flag
      uint32_t teif4 : 1;  // transfer error (TE) flag
      uint32_t gif5 : 1;   // global interrupt flag
      uint32_t tcif5 : 1;  // transfer complete (TC) flag
      uint32_t htif5 : 1;  // half transfer (HT) flag
      uint32_t teif5 : 1;  // transfer error (TE) flag
      uint32_t gif6 : 1;   // global interrupt flag
      uint32_t tcif6 : 1;  // transfer complete (TC) flag
      uint32_t htif6 : 1;  // half transfer (HT) flag
      uint32_t teif6 : 1;  // transfer error (TE) flag
      uint32_t gif7 : 1;   // global interrupt flag
      uint32_t tcif7 : 1;  // transfer complete (TC) flag
      uint32_t htif7 : 1;  // half transfer (HT) flag
      uint32_t teif7 : 1;  // transfer error (TE) flag
      uint32_t reserved : 4;
    };
    uint32_t full_reg;
  } interrupt_clear;  // Interrupt Flag Clear Register [RM] 11.6.2 (pg 311)
  struct ChannelRegs {
    struct {
      uint32_t enable : 1;
      uint32_t tx_complete_interrupt : 1;
      uint32_t half_tx_interrupt : 1;
      uint32_t tx_error_interrupt : 1;
      uint32_t direction : 1;
      uint32_t circular : 1;
      uint32_t peripheral_increment : 1;
      uint32_t memory_increment : 1;
      uint32_t peripheral_size : 2;
      uint32_t memory_size : 2;
      uint32_t priority : 2;
      uint32_t mem2mem : 1;
      uint32_t reserved : 17;
    } config;
    uint32_t count;
    volatile void *peripheral_address;
    volatile void *memory_address;
    uint32_t reserved;
  } channel[7];
  uint32_t reserved[5];
  union {
    struct {
      uint32_t c1s : 4;
      uint32_t c2s : 4;
      uint32_t c3s : 4;
      uint32_t c4s : 4;
      uint32_t c5s : 4;
      uint32_t c6s : 4;
      uint32_t c7s : 4;
      uint32_t reserved : 4;
    };
    uint32_t full_reg;
  } channel_select;  // Channel Selection Register [RM] 11.6.7 (pg 317)
};
typedef volatile DmaStruct DmaReg;
inline DmaReg *const Dma1Base = reinterpret_cast<DmaReg *>(0x40020000);
inline DmaReg *const Dma2Base = reinterpret_cast<DmaReg *>(0x40020400);

