RespiraWorks/Ventilator/software/controller/lib/hal/hal_stm32_regs.h
/* Select the source for a DMA channel:
  @param dma        Address of DMA registers
  @param chan       DMA channel to modify.  Channels are numbered from 0
  @param selection  Selects which peripheral request to map to the channel
*/
inline void DmaSelectChannel(DmaReg *dma, DmaChannel chan, int selection) {
  selection &= 0x0F;

  int x = 4 * static_cast<int>(chan);  // 4 bits per channel ([RM] 11.3.2)

  uint32_t val = dma->channel_select.full_reg;
  val &= ~(0xF << x);
  val |= selection << x;
  dma->channel_select.full_reg = val;
}

enum class DmaInterrupt { Global = 1, TransferComplete = 2, HalfTransfer = 4, TransferError = 8 };

// Detect a DMA Interrupt
inline bool DmaIntStatus(DmaReg *dma, DmaChannel chan, DmaInterrupt interrupt) {
  uint32_t x = static_cast<uint32_t>(interrupt);
  x <<= 4 * static_cast<uint8_t>(chan);  // 4 events per channel ([RM] 11.6.2)
  return (x & dma->interrupt_status.full_reg) > 0;
}

// Clear a DMA Interrupt
inline void DmaClearInt(DmaReg *dma, DmaChannel chan, DmaInterrupt interrupt) {
  uint32_t x = static_cast<uint32_t>(interrupt);
  x <<= 4 * static_cast<uint8_t>(chan);  // 4 events per channel ([RM] 11.6.2)
  dma->interrupt_clear.full_reg = x;
}

// [RM] 40.6 SPI Registers (pg 1330)
struct SpiStruct {
  struct {
    uint32_t clock_phase : 1;
    uint32_t clock_polarity : 1;
    uint32_t master : 1;
    uint32_t bitrate : 3;
    uint32_t enable : 1;
    uint32_t lsb_first : 1;
    uint32_t internal_slave_select : 1;
    uint32_t sw_slave_management : 1;
    uint32_t rx_only : 1;
    uint32_t crc_length : 1;
    uint32_t crc_next : 1;
    uint32_t crc_enable : 1;
    uint32_t bidir_output : 1;
    uint32_t bidir_mode : 1;
    uint32_t reserved : 16;
  } control_reg1;  // Control register 1 (SPIx_CR1) [RM] 40.6.1 (pg 1330)
  struct {
    uint32_t rx_dma : 1;
    uint32_t tx_dma : 1;
    uint32_t ss_output : 1;
    uint32_t nss_pulse : 1;
    uint32_t frame_format : 1;
    uint32_t error_interrupt : 1;
    uint32_t rx_not_empty_interrupt : 1;
    uint32_t tx_empty_interrupt : 1;
    uint32_t data_size : 4;
    uint32_t fifo_rx_threshold : 1;
    uint32_t last_dma_rx : 1;
    uint32_t last_dma_tx : 1;
    uint32_t reserved : 17;
  } control2;  // Control register 2 (SPIx_CR2) [RM] 40.6.2
  uint32_t status;
  uint32_t data;
  uint32_t crc_polynomial;
  uint32_t rx_crc;
  uint32_t tx_crc;
};
typedef volatile SpiStruct SpiReg;
inline SpiReg *const Spi1Base = reinterpret_cast<SpiReg *>(0x40013000);
inline SpiReg *const Spi2Base = reinterpret_cast<SpiReg *>(0x40003800);
inline SpiReg *const Spi3Base = reinterpret_cast<SpiReg *>(0x40003C00);

// [RM] 37.7 I2C Registers
struct I2CStruct {
  union {
    struct {
      uint32_t enable : 1;
      uint32_t tx_interrupts : 1;
      uint32_t rx_interrupts : 1;
      uint32_t addr_interrupts : 1;
      uint32_t nack_interrupts : 1;
      uint32_t stop_interrupts : 1;
      uint32_t tx_complete_interrupts : 1;
      uint32_t error_interrupts : 1;
      uint32_t digital_noise_filter_conntrol : 4;
      uint32_t analog_noise_filternig_off : 1;
      uint32_t reserved1 : 1;
      uint32_t dma_tx : 1;
      uint32_t dma_rx : 1;
      uint32_t slave_byte : 1;
      uint32_t no_clock_stretch : 1;
      uint32_t wake_from_stop : 1;
      uint32_t general_call : 1;
      uint32_t smbus_default_host : 1;
      uint32_t smbus_default_device : 1;
      uint32_t smbus_alert : 1;
      uint32_t smbus_packet_error_checking : 1;
      uint32_t reserved2 : 8;
    };
    uint32_t full_reg;
  } control_reg1;  // Control register 1 [RM] 37.7.1
  union {
    struct {
      uint32_t slave_addr_lsb : 1;           // lsb of 10 bits slave address
                                             // (master)
      uint32_t slave_addr_7b : 7;            // middle 7b bits of slave address
                                             // (master)
      uint32_t slave_addr_msb : 2;           // msb of 10 bits slave address
                                             // (master)
      uint32_t transfer_direction : 1;       // 0 = write, 1 = read (master)
      uint32_t address_10b : 1;              // Set to enable 10 bits address header
                                             // (master)
      uint32_t read_10b_header : 1;          // Clear to send complete read sequence
                                             // (master)
      uint32_t start : 1;                    // Set to generate START condition
      uint32_t stop : 1;                     // Set to generate STOP after byte transfer
                                             // (master)
      uint32_t nack : 1;                     // Generate NACK after byte reception (slave)
      uint32_t n_bytes : 8;                  // Set to the number of bytes to send
      uint32_t reload : 1;                   // Set to allow several consecutive transfers
      uint32_t autoend : 1;                  // Set to automatically send stop condition
      uint32_t packet_error_check_byte : 1;  // Set to send SMBus packet error
                                             // checking byte
      uint32_t reserved : 5;
    };
    uint32_t full_reg;
  } control2;        // Control register 2 [RM] 37.7.2
  uint32_t addr[2];  // Own address (1-2) register [RM] 37.7.{3,4} (slave)
  union {
    struct {
      uint32_t scl_low : 8;    // Duration of SCL Low state (cycles)
      uint32_t scl_high : 8;   // Duration of SCL High state (cycles)
      uint32_t sda_hold : 4;   // Delay between SCL falling edge and SDA
                               // edge (cycles)
      uint32_t scl_delay : 4;  // Delay between SDA edge and SCL rising
                               // edge (cycles)
      uint32_t reserved : 4;
      uint32_t prescaler : 4;  // Prescaler
    };
    uint32_t full_reg;
  } timing;          // Timing register [RM] 37.7.5
  uint32_t timeout;  // Timout register [RM] 37.7.6
  union {
    struct {
      uint32_t tx_empty : 1;
      uint32_t tx_interrupt : 1;
      uint32_t rx_not_empty : 1;
      uint32_t address_match : 1;
      uint32_t nack : 1;
      uint32_t stop : 1;
      uint32_t transfer_complete : 1;
      uint32_t transfer_reload : 1;
      uint32_t bus_error : 1;
      uint32_t arbitration_loss : 1;
      uint32_t overrun : 1;
      uint32_t packet_check_error : 1;
      uint32_t timeout : 1;
      uint32_t alert : 1;
      uint32_t reserved1 : 1;
      uint32_t busy : 1;
      uint32_t transfer_direction : 1;
      uint32_t address_code : 7;
      uint32_t reserved : 8;
    };
    uint32_t full_reg;
  } status;                     // Interrupt & status register [RM] 37.7.7
  uint32_t interrupt_clear;     // Interrupt clear register [RM] 37.7.8
  uint32_t packet_error_check;  // PEC register [RM] 37.7.9
  uint32_t rx_data;             // Receive data register [RM] 37.7.10
  uint32_t tx_data;             // Transmit data register [RM] 37.7.11
};
typedef volatile I2CStruct I2CReg;
inline I2CReg *const I2C1Base = reinterpret_cast<I2CReg *>(0x40005400);
inline I2CReg *const I2C2Base = reinterpret_cast<I2CReg *>(0x40005800);
inline I2CReg *const I2C3Base = reinterpret_cast<I2CReg *>(0x40005c00);
inline I2CReg *const I2C4Base = reinterpret_cast<I2CReg *>(0x40008400);

// Watchdog timer
// [RM] 32.4 Watchdog Registers (pg 1016)
struct WatchdogStruct {
  uint32_t key;        // Key register [RM] 32.4.1
  uint32_t prescaler;  // Prescale register [RM] 32.4.2
  uint32_t reload;     // Reload register [RM] 32.4.3
  uint32_t status;     // Status register [RM] 32.4.4
  uint32_t window;     // Window register [RM] 32.4.5
};
typedef volatile WatchdogStruct WatchdogReg;
inline WatchdogReg *const WatchdogBase = reinterpret_cast<WatchdogReg *>(0x40003000);

// CRC calculation unit
// [RM] 14.4 CRC Registers (pg 341)
struct CrcStruct {
  uint32_t data;     // Data register [RM] 14.4.1
  uint32_t scratch;  // Independent data register [RM] 14.4.2
  uint32_t control;  // Control register [RM] 14.4.3
  uint32_t reserved;
  uint32_t init;        // Initial CRC value [RM] 14.4.4
  uint32_t polynomial;  // CRC polynomial [RM] 14.4.5
};
typedef volatile CrcStruct CrcReg;
inline CrcReg *const CrcBase = reinterpret_cast<CrcReg *>(0x40023000);

// General Purpose I/O
// [RM] 8.4 GPIO Registers (pg 267)
struct GpioStruct {
  uint32_t mode;                   // Mode register [RM] 8.4.1
  uint32_t output_type;            // Output type register [RM] 8.4.2
  uint32_t output_speed;           // Output speed register [RM] 8.4.3
  uint32_t pullup_pulldown;        // Pull-up/pull-down register [RM] 8.4.4
  uint32_t input_data;             // Input data register [RM] 8.4.5
  uint32_t output_data;            // Output data register [RM] 8.4.6
  uint16_t set;                    // Bit set register [RM] 8.4.7
  uint16_t clear;                  // Bit reset register [RM] 8.4.7
  uint32_t flash_lock;             // Configuration lock register [RM] 8.4.8
  uint32_t alternate_function[2];  // Alternate function low/high register
                                   // [RM] 8.4.{9,10}
  uint32_t reset;                  // Reset register [RM] 8.4.11
};
typedef volatile GpioStruct GpioReg;
inline GpioReg *const GpioABase = reinterpret_cast<GpioReg *>(0x48000000);
inline GpioReg *const GpioBBase = reinterpret_cast<GpioReg *>(0x48000400);
inline GpioReg *const GpioCBase = reinterpret_cast<GpioReg *>(0x48000800);
inline GpioReg *const GpioDBase = reinterpret_cast<GpioReg *>(0x48000C00);
inline GpioReg *const GpioEBase = reinterpret_cast<GpioReg *>(0x48001000);
inline GpioReg *const GpioHBase = reinterpret_cast<GpioReg *>(0x48001C00);

#endif
